{"term": "Whispering Woods", "definition": "A mysterious forest surrounding the village of Elmsworth, known for its whispering trees that reveal secrets.", "relevance": "High"}
{"term": "Clara", "definition": "A young girl with a strong curiosity about the Whispering Woods, despite warnings from her father.", "relevance": "High"}
{"term": "Compass", "definition": "A tool given to Clara by her father to help her find her way home, symbolizing guidance and safety.", "relevance": "Medium"}
{"term": "Rolo", "definition": "Clara's adventurous dog who accompanies her into the Whispering Woods.", "relevance": "Medium"}
{"term": "Oak Tree", "definition": "An ancient, wise tree in the clearing of the Whispering Woods that communicates with Clara.", "relevance": "High"}
{"term": "Magical Leaf", "definition": "A glowing leaf given to Clara by the oak tree, containing a piece of the forest's magic.", "relevance": "High"}
{"term": "Elmsworth", "definition": "A small village nestled in a valley, surrounded by the Whispering Woods.", "relevance": "Low"}
{"term": "father", "definition": "Clara's father, who warns her about the dangers of the Whispering Woods.", "relevance": "Medium"}
{"term": "Enhanced Sense Tracking", "definition": "A power allowing Rolo to track anything or anyone across vast distances, even through magical barriers, based on a dog's keen sense of smell.", "relevance": "High"}
{"term": "Bark of Command", "definition": "A powerful bark that can influence or command other animals, and possibly creatures within the Whispering Woods, to either calm or rally them.", "relevance": "High"}
{"term": "Pack Bonding", "definition": "The ability to form a temporary pack bond with other creatures, enabling telepathic communication and sharing of emotions or basic thoughts.", "relevance": "Medium"}
{"term": "Guardian Aura", "definition": "A protective aura that shields Rolo and Clara from harm, deflecting minor magical attacks or lessening physical blows.", "relevance": "Medium"}
{"term": "Speed Burst", "definition": "The ability to have short bursts of incredible speed, allowing Rolo to quickly dash out of danger or tackle an adversary.", "relevance": "Low"}
{"term": "Healing Lick", "definition": "A lick with minor healing properties, providing comfort and speeding up the healing process of wounds or ailments.", "relevance": "Low"}
